package ua.com.javacertificateoracle.lesson16;

import java.util.Locale;

public class Line {
    /*Пишем функцию которая принимает текс и выводит в консоль с новой строки когда встречает заглавную букву*/
    public static void newLine(String s) {
    /*Создаем новую строку которая равна принемаемой только написана заглавными буквами
    (для того чтобы было с чем сравнивать)*/
        String newS = s.toUpperCase(Locale.ROOT);
        //Создаем две переменные которые будут принемать значение (по символьно) оригинальной и модифицированной строк
        char c1;
        char c2;
        //Пишем цикл который будет перебирать оригинальную строку посимвольно
        for (int i = 0; i < s.length(); i++) {
            c1 = s.charAt(i);
            c2 = newS.charAt(i);
    /*Пишем условие в котором проверяется НЕ равенство переменной типа char знакам припенания
    (потому что знаки припенания не изменяются и нам не счем их сравнивать) и РАВЕНСТВО
    между собой двух переменных типа char*/
            if (c1 != ';' && c1 != '.' && c1 != ',' && c1 != '!' && c1 != '?' && c1 != ' ' && c1 == c2) {
    /*Если все условия выполнены, значит в проверяемой строке идет заглавная буква
    и мы переносим курсор на новую строку и пишем букву*/
                System.out.println();
                System.out.print(c1);
                //Оператор continue переносит насна начало цикла игнорируя код ниже
                continue;
            }
    /*Если программа дошла до этой строки значит буква в проверяемой строке была НЕ заглавной
    и не знак припинания по этому программ не зашла в тело условия, я это значит
    нам не надо переносит курсор на новую строку*/
            System.out.print(c1);
        }
    }
}
